component/onvif/onvifgen/xml/MediaBinding.SetMetadataConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:ns1="http://www.onvif.org/ver20/analytics/humanface"
    xmlns:ns2="http://www.onvif.org/ver20/analytics/humanbody"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
    xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
    xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
    xmlns:tse="http://www.onvif.org/ver10/search/wsdl">
 <SOAP-ENV:Body>
   <trt:SetMetadataConfiguration>
    <trt:Configuration xsi:type="tt:MetadataConfiguration" token="" CompressionType="" GeoLocation="false" ShapePolygon="false">
     <tt:Name xsi:type="tt:Name"></tt:Name>
     <tt:UseCount xsi:type="xsd:int">0</tt:UseCount>
     <tt:PTZStatus xsi:type="tt:PTZFilter">
      <tt:Status xsi:type="xsd:boolean">false</tt:Status>
      <tt:Position xsi:type="xsd:boolean">false</tt:Position>
     </tt:PTZStatus>
     <tt:Events xsi:type="tt:EventSubscription">
      <tt:Filter xsi:type="wsnt:FilterType">
       <!-- extensibility element(s) -->

      </tt:Filter>
      <tt:SubscriptionPolicy>
       <!-- extensibility element(s) -->

      </tt:SubscriptionPolicy>
      <!-- extensibility element(s) -->

     </tt:Events>
     <tt:Analytics xsi:type="xsd:boolean">false</tt:Analytics>
     <tt:Multicast xsi:type="tt:MulticastConfiguration">
      <tt:Address xsi:type="tt:IPAddress">
       <tt:Type xsi:type="tt:IPType">IPv4</tt:Type>
       <tt:IPv4Address xsi:type="tt:IPv4Address"></tt:IPv4Address>
       <tt:IPv6Address xsi:type="tt:IPv6Address"></tt:IPv6Address>
      </tt:Address>
      <tt:Port xsi:type="xsd:int">0</tt:Port>
      <tt:IPSTACK_TTL xsi:type="xsd:int">0</tt:IPSTACK_TTL>
      <tt:AutoStart xsi:type="xsd:boolean">false</tt:AutoStart>
      <!-- extensibility element(s) -->

     </tt:Multicast>
     <tt:SessionTimeout xsi:type="xsd:duration">PT0S</tt:SessionTimeout>
     <!-- extensibility element(s) -->

     <tt:AnalyticsEngineConfiguration xsi:type="tt:AnalyticsEngineConfiguration">
      <tt:AnalyticsModule xsi:type="tt:Config" Name="" Type="xsd:string">
       <tt:Parameters xsi:type="tt:ItemList">
        <tt:SimpleItem Name="" Value="">
        </tt:SimpleItem>
        <tt:ElementItem Name="">
        </tt:ElementItem>
        <tt:Extension xsi:type="tt:ItemListExtension">
        </tt:Extension>
       </tt:Parameters>
      </tt:AnalyticsModule>
      <tt:Extension xsi:type="tt:AnalyticsEngineConfigurationExtension">
       <!-- extensibility element(s) -->

      </tt:Extension>
     </tt:AnalyticsEngineConfiguration>
     <tt:Extension xsi:type="tt:MetadataConfigurationExtension">
      <!-- extensibility element(s) -->

     </tt:Extension>
    </trt:Configuration>
    <trt:ForcePersistence xsi:type="xsd:boolean">false</trt:ForcePersistence>
   </trt:SetMetadataConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
